{
    "science":[
        {
            "name":"Why Science?",
            "description":" Science is much more than memorization of facts, theory, and formulas. It is up to the educators to make young learners think about science as more than an academic discipline. In the classrooms, science should be portrayed as something that helps them acquire skills and discover truths. This approach is key to creating an engaged student community."
        },
        {
            "name":"1. Medicine",
            "description":"The medical field encompasses everything from diagnostic practice to other related activities undertaken across the healthcare, pharmaceutical, and biotech-based industries. It is arguably one of the most popular courses after 12th science. If you have studied Physics, Chemistry, Biology (PCB) at the 10+2 level, you can think about the following courses:\n\nBachelor of Medicine and Bachelor of Surgery (MBBS)\n\nBachelor of Dental Surgery\n\nBachelor of Pharmacy\n\nBachelor of Medical Lab Technology\n\nVeterinary Science & Animal Husbandry (BVSc. AH)\n\nPhysiotherapy (BPT) or Occupational Therapy (BOT)\n\nB.Tech/BE in Biotechnology\n\nB.Sc. in Agriculture and Environment Science\n\nB.Sc. Home Science/Forensic Science\n\nDiploma courses in operation theatre technology, medical laboratory, x-ray technology, etc.\n\nIf you have a bio-math combination of subjects, various interdisciplinary options open besides basic sciences and its allied fields, including the following:\n\nBiomedical engineering\n\nHealthcare data mining\n\nCognitive neuroscience and artificial intelligence\n\nNanotechnology\n\nRobotics\n\nInternet of things and smart wearable technology."
        },
        {
            "name":"2. Engineering",
            "description":"The engineering profession offers a vast range of career options after 12th science. Some of them are listed below:\n\nMechanical Engineers: They apply principles of physics and mathematics to design, produce, and operate machinery. \n\nElectrical and Electronics Engineers: They are responsible for designing, building, testing, and supervising the manufacture of electrical systems and electronic equipment, such as electric motors, navigation, and communication systems. \n\nComputer Engineers: Their work is concerned with computer programming, software development, mobile, and web applications.\n\nCivil Engineers: They conceive, supervise, and maintain infrastructure projects in the public and private sectors, including buildings, dams, bridges, airports, water supply, and sewage systems.\n\nChemical Engineers: They design and develop chemical manufacturing processes. These skilled experts solve problems related to production or use of chemicals, drugs, fuel, food, and other products. \n\nAerospace Engineers: They take on specialized areas of aircraft and spacecraft development.\n\nMarine Engineers: They are in charge of the internal systems of ships, oil rigs, and other overseas structures."
        },
        {
            "name":"3. Business",
            "description":"Traditionally, commerce stream jobs revolved around Chartered Accountant, Company Secretary, Chartered Financial Analyst, Actuarial Science, Banking, etc. Although these career choices remain popular to this day, they now have the company of other lucrative professions. We have mentioned a few of them below:\n\nBusiness management\n\nProduct management\n\nAdvertising and sales management \n\nBusiness and data analysis\n\nDigital marketing\n\nHuman resource development \n\nManagement consultancy\n\nScience graduates can also pursue these career paths by combining their technical and conceptual strengths with an understanding of the business world. Leading institutions and industry experts have come together to facilitate this transition via job-oriented courses."
        },
        {
            "name":"4. Humanities",
            "description":"Science students can go into diverse careers, even in humanities and the arts. The roles that explore such connections are commonly known as STEAM jobs. Here is a list of some popular trans-disciplinary fields:\n\nProduct Designing\n\nGraphic Designing\n\nFashion Technology\n\nMedia/Journalism\n\nAnimation Filmmaking\n\nPhotography \n\nVideo Creation and Editing\n\nSound Engineering\n\nHR Training, School Teaching, etc."
        }
    ],
    "commerce":[
        {
            "name":"Introduction",
            "description":"Often, we run over this question from the Commerce students or the students who are going to looking for Career in Commerce after the tenth board exams. Students many times have a lot of queries. “What is the rundown of Courses for commerce students after the end of their schooling?” or “What are the profession choices accessible for 12th Commerce stream students?” “What are the best courses after 12th commerce that do not involve mathematics?”."
        },
        {
            "name":"Bachelors of Commerce (B.Com)",
            "description":"The most common undergrad program for commerce students is Bachelors of Commerce or B.Com, a three-year general degree program. Those pursuing professional courses can do a B Com which will boost their academic profile. Besides, it is advisable to do a graduate program before going for higher studies. B.Com can be pursued as a full-time or as a correspondence course in case one is pursuing a professional program like CA, CS, etc"
        },
        {
            "name":"Bachelors of Commerce (Honours) or B.com (Hons)",
            "description":"This is B.com with specialization in fields like Accountancy, management or economics etc. The industry demand for B.com (Honours) is somewhat better than normal B.com. The admission and eligibility criteria are the same for both and admission is normally based on merit, while some colleges take admission tests. Subjects taught are mostly the same, but in the honors course, one gets to study more extensively."
        },
        {
            "name":"Bachelors in Economics",
            "description":"Commerce students can pursue BSc. Economics Hons after plus two. The core study area includes economic policies, analytical methods, and programs etc. Those interested in economics and aspire to do specialization in the concept of the economic framework can opt for this course."
        },
        {
            "name":"Bachelors of Business Administration (BBA)",
            "description":"A three-year Business Administration course helps build a foundation in core business disciplines. One gets to look at different functional domains of business. BBA from a recommended institution helps students get specialized in business insights and real-world business skills.\n\nAfter BBA one can do a master’s program like M.Com (Finance) or MBA. Those aiming to make a career in finance and business management can think of taking this cours"
        },
        {
            "name":"Bachelor of Management Studies (BMS)",
            "description":"This is a three-year undergraduate programme which prepares students for the field of management. The program provides theoretical and practical knowledge in inculcating leadership and managerial skills which help students explore numerous of opportunities in the business world.\n\nCore area of study includes – management, human resources, organizational theories, research methodology etc. With demand for skilled managerial professionals, ever-increasing having the requisite degree from a reputed institution will help students get success in the corporate world."
        },
        {
            "name":"Chartered Accountancy (CA)",
            "description":"This is the most popular and sought-after professional course for building a great and lucrative career in commerce. Chartered Accountancy opens the doors to exciting career opportunities as a Tax Consultant, an auditor, an advisor, a financial officer et al. One can also opt for independent practice.\n\nHowever, CA is a very difficult and complex course hence requires a lot of hard work and sincere efforts to qualify. Clearing the initial level might be easy but as one goes to the higher levels i.e. Intermediate (IPCC) and CA Finals, it gets extremely tough. It is only through total determination and consistent efforts that one can complete the program successfully. The new curriculum includes Foundation, Intermediate and Final levels."
        },
        {
            "name":"Company Secretary (CS)",
            "description":"Yet another professional course is Company Secretary or CS. Opted by many students after 12th commerce this course is carried out by The Institute of Company Secretaries of India. A Company Secretary is actually responsible for regulatory compliance of the company and operates as an in-house legal advisor. CS qualified individuals can either practice independently or get hired in the corporate world. A combination of CA and CS is a popular choice as it helps in building a rewarding career."
        },
        {
            "name":"Cost and Management Accountant (CMA)",
            "description":"Offered by The Institute of Cost Accountants of India or ICWAI, this is also a very useful course for commerce students. The responsibilities of a Cost Accountant include maintaining accounting records, carrying out cost auditing and assisting in planning, controlling and costing of products.\n\nOne can opt for individual practice as a CMA or look for jobs in public or private sectors and work in cost audit area, certification and consulting areas. The function of Cost Accountant is much more than that of a Financial Accountant as the former helps in production operations and processes."
        },
        {
            "name":"Certified Financial Planner (CFP)",
            "description":"Those interested to make a career in Personal finance, wealth management, insurance planning, mutual fund investing can think of doing a course in Certified Financial Planning or CFP. To make it into the financial planning world one needs this certification in order to operate as a Certified Financial Planner or CFP."
        }
    ],
    "arts":[
        {
            "name":"What to do after 12th Arts?",
            "description":"As a field of study, arts (or humanities) draws inspiration from history, language, cultures, societal norms, philosophy, visual arts, music, and other intellectual aspects of life. Students pursuing arts subjects are taught and trained to harness their exploratory, analytical, and critical faculties. Thus, students who complete their higher secondary studies in arts find it quite comfortable to prepare for the Indian Civil Services examinations. It is not easy to find high paying jobs for 12th arts if one has not chosen the right courses after 12th arts.\n\nSome of the most promising subjects taught under humanities include History, Geography, Sociology, Economics, Mass Communication, Law, Psychology, Political Science, Linguistics, and Language studies (English, Hindi, Sanskrit, etc.). One of the best things about 12th arts is that there are plenty of career options after 12th arts. One has to know the list of all career options after 12th arts to select the right one and it can be overwhelming to choose right career options for arts students because of the number of options available. "
        },
        {
            "name":"Bachelor of Arts (B.A.)",
            "description":"B.A. specializations provide tremendous flexibility to students deepen their cultural understanding and awareness and also encourage them to develop their critical thinking, analytical, written, and communication skills. The best thing about graduating with a B.A. honours is that students enjoy plenty of job opportunities spread across industries like academia, tourism & hospitality, aviation, BFSI sector, media and entertainment, and also government agencies."
        },
        {
            "name":"achelor of Fine Arts (B.F.A.)",
            "description":"If you are wondering what to do after 12th arts, a popular career choice among students after 12th arts is studying fine arts. Bachelor of Fine Arts is the perfect career option for aspirants who have a creative flair. Just like B.A. course, B.F.A is also a 3-year program that includes Fine Arts, Visual Arts, and Performing Arts. Students can take up unique specialization courses like Theatre, Film Making, Music, Dance, Painting & Sculpting, Pottery & Ceramics, Creative Writing, Architectural Drawing, Textile Design, and Animation. "
        },
        {
            "name":"Bachelor of Business Administration (B.B.A.)",
            "description":"BBA is the most popular course available for students & one of the best courses after 12th Arts. Bachelor of Business Administration is most coveted and pursued bachelor degree career options after class 12th. The best part about the B.B.A. course is that it is open to all students hailing from the three streams, arts, commerce, and science. It is a 3-year, full-time undergraduate course that opens up employment opportunities in a host of industrial sectors like Sales, Marketing, Finance, Education, Hospitality, and Government. BBA is one of the popular career options for arts students."
        },
        {
            "name":"Integrated Law course (B.A + L.L.B.)",
            "description":"As the name suggests, and integrated law course refers to dual degrees, one being Bachelor of Arts (B.A.) and the other being Bachelor of Legislative Law (L.L.B.). Since it combines two full-fledged courses, the course duration is 5 years, divided into ten semesters. The biggest perk of pursuing an integrated law course is that you can obtain dual degrees within the scope of one curriculum. It is the best career options for students who are wondering what to do after 12th arts and interested in law."
        },
        {
            "name":"Bachelor of Journalism and Mass Communication (B.J.M.)",
            "description":"Still need options before deciding what to do after 12th arts? Bachelor of Journalism and Mass Communication is a 3-year undergraduate course divided into six semesters. The course curriculum includes a variety of fields such as Print Journalism, Television and Radio Production, Television Production and Writing, Advertising and Public Relations, Event Management, Social Media, Film Studies, and Media Law and Ethics."
        },
        {
            "name":"Bachelor of Fashion Design (B.F.D.)",
            "description":"BFD is one of the best courses after 12th arts. Bachelor of Fashion Design is a 3 to 4-year long undergraduate course specially designed for aspirants aiming to enter the fashion industry. The B.F.D. program involves the dynamic trends in the fashion industry and teaches students how to create original designs for garments, jewellery, footwear, accessories, and so on."
        },
        {
            "name":"Bachelor of Hotel Management (B.H.M.)",
            "description":"Our list of answers to ‘What to do after 12th arts?’ would be incomplete if we don’t mention this field.\n\nIf you are wondering what to do after 12th arts, BHM is one of the many pivotal job roles in an organization. Bachelor of Hospitality Management is a 3-4 year-long undergraduate management course that trains aspirants to enter the hospitality industry. The course covers a broad range of specialization areas including tourism, event management, lodging management, and the food and beverage industry."
        }
    ]
}