{
    "iti": [
      {
        "name": "ITI Electrician",
        "description": "It is the Best ITI course related to electric devices and wiring.\n\nbest iti courses list after 10th and 12th class\n\nIf you want a quick job after 2 or 3 years then you can go for the Electrician Course in ITI.\n\nElectrician Course may prove one of the best ITI courses for those who are interested in installing, maintaining, repairing and operating electrical devices.\n\nThose electrical devices like household appliances, lighting, electrical machines, wiring for residence and industries etc.\n\nCourse Duration – 2 years ( 4 Semesters )"
      },
      {
        "name": " ITI Fitter",
        "description": "It is the Best ITI course related to Machinery and its parts, assembling or fitting the manufacturing parts to make a complete engine or machine.\n\nbest iti courses list after 10th and 12th class\n\nIf you want a quick job after 2 or 3 years then you can go for the Fitter Trade in ITI.\n\nIt is the best ITI course for those who are interested in fitting or assembling machining and engine parts.\n\nCourse Duration – It is about 2 years ( 4 Semesters ) course"
      },
      {
        "name": "ITI Diesel Mechanic",
        "description": "It is the Best Vocational  ITI Trade related to Machinery or vehicles like Motor, Tractor, Truck, Bus, Trains, Bike etc.\n\nbest iti courses list after 10th and 12th class\n\nIf you want a quick job after 1 or 2 years then you can go for the Diesel Mechanic Trade in ITI.\n\nIf you are interested in repairing, maintaining, inspecting, testing vehicles like trucks, buses, trains, bikes, motors, and many more.\n\nThen you can join the ITI diesel Mechanic Course. \n\nIf you planning to join a diesel mechanic course then you should be physically fit and hardworking.\n\nCourse Duration –It is about 1 year ( 2 Semesters ) course"
      },
      {
        "name": "ITI COPA",
        "description": "It is the Best ITI course related to computers including, software, hardware and programming languages.\n\nbest iti courses list after 10th and 12th class\n\nIf you want a quick job after 1 or 2 years then you can go for the COPA Trade in ITI.\n\nFull form of COPA – Computer Operator and Programming Assistant.\n\nCourse Duration – It is about 1 year ( 2 Semesters ) course"
      },
      {
        "name": "ITI Wireman",
        "description": "It is the Best Vocational ITI course related to electrical engineering components, lightning, current, wiring.\n\nIf you want a quick job after 2 or 3 years then you can go for the Wireman Trade-in ITI.\n\nCourse Duration – It is about 2 years ( 4 Semesters ) course"
      },
      {
        "name": "ITI Welder",
        "description": "It is the Best Vocational ITI course and it is the process of joining metal or thermoplastic parts with the use of high-temperature heat and molten metal, filler metal or metallic rod.\n\nCourse Duration –It is about 1 year ( 2 Semesters ) course"
      },
      {
        "name": "ITI Electronics Mechanic",
        "description": "It is the Best Vocational ITI course related to electronic equipment like a transformer, batteries, regulators, transmitters, computer hardware, radar systems etc.\n\nCourse Duration – It is about 2 years ( 4 Semesters ) course"
      },
      {
        "name": "ITI Plumber",
        "description": "It is the Best Vocational ITI course related to the equipment of water supply, sewage equipment, like pipes, valve, water tank, filters, pump, etc.\n\nCourse Duration – It is about 1 year ( 2 Semesters ) course"
      },
      {
        "name": "ITI Carpenter",
        "description": "It is the Best Vocational ITI course related to wood and wooden objects like table house, bed, chair, cupboard, doors, windows and many more.\n\nCourse Duration – It is about 1 year ( 2 Semesters ) course"
      },
      {
        "name": "ITI Instrument Mechanic",
        "description": "Course Duration – It is about 2 years ( 4 Semesters ) course"
      }
    ],
    "sca": [
      {
        "name": "1. Science",
        "description": "• Science is the most popular and favourite career option for the majority of the parents and students.\n\n• Science stream offers many lucrative career options such as engineering, medical, IT and you can even opt for research roles.\n\n• The best advantage of taking science stream is, it keeps your options open. You might switch from science to commerce or science to arts. But it is not possible to do the other way around.\n\n• Taking science stream equips you with excellent problem-solving abilities. "
      },
      {
        "name": "2. Commerce",
        "description": "Commerce is the second most popular career option after science. If you love numbers, finances, economics etc., then finance is the best option for you.\n\n• It offers a wider variety of career options such as Chartered Accountants, MBA, investment in banking sectors etc.\n\n• You acquire commercial knowledge which is very important for the business.\n\n• You have to be familiar with the subjects such as Accountancy, Finance, Economics etc.\n\n• You must be good with numbers, data and have a curiosity in Finance, economics. \n\n• Commerce as a subject is gaining popularity in India and many students are studying and making a living out of it."
      },
      {
        "name": "Arts/Humanities",
        "description": "• Nowadays arts/humanities are very high in demand and more and more students are opting for it. \n\n• Arts is now emerging as a sought after career choice. It provides students with an array of career opportunities.\n\n• It offers many lucrative career options such as Journalism, languages, history, psychology etc.\n\n• Design, Language Arts, Performing arts, Humanities are well-paid career options.\n\n• Arts subject encourage creativity and self-expression.\n\n• Students who take up art stream develop critical thinking. It also helps you increase your leadership qualities."
      }
    ]
  }