{
    "entrance": [
        {
            "name": "AIEED",
            "syllabus": "The examination aims to test and assess the problem solving skills, design sensitivity, logical reasoning, creative skills and general knowledge. With the total marks of 200, 45 to 50 questions would be questioned. The questions are available in bilingual (English and Hindi) for both online and offline examinations. But the online examination must be answered in English only, where as offline exam is allowed to be answered in English or Hindi.",
            "description": "All India Entrance Exam for Design (AIEED) is conducted by ARCH Academy of Design. The exam is conducted as entrance exam for the designing courses in Under Graduate Level and Post Graduate level. Programs offered in Under Gradual Level are Fashion Design, Interior Design, Jewellery Design, Graphics Design, Craft Product Design, Design Management and Bachelor of Visual Arts. Programs offered in Post Graduate level are Fashion Design, GPEM, Interior Design, Jewellery Design, Life style Accessory Design, Design Communication, Strategic Design Management and Strategic Management & Leadership.",
            "eligibility": "The eligibility for Undergraduate Level is 10+2 from recognized board or equivalent. The students those who have appeared and those who have cleared are eligible for appearing the entrance exam. The students who cleared 10+1 are also eligible to appear AIEED, but the admission for the qualified students will be interviewed after 10+2 to get admitted."
        },
        {
            "name": "AIEEE",
            "syllabus": "The syllabus followed for AIEEE exam consists of syllabi followed by Central Board of Secondary Education, as well as all nationwide state boards, which is also discussed below:\nPhysics: Law of Motion, Rational Motion, Work etc.\nChemistry: States of Matter, Chemical Kinetics, Chemical Bonding, Surface Chemistry etc.\nMathematics: Relations, Sets, Complex Numbers, Integral Calculus, Functions etc.\nAptitude Test: Knowledge of materials, persons, buildings, places etc., along with Analytical Reasoning Mental Ability",
            "description": "Started in 2002, AIEEE or All India Engineering Entrance Examination is a competitive test held on national level in India and organized by CBSE or the Central Board of Secondary Education. Students seeking admission in architecture and under graduate engineering courses in colleges and institutes all over India are required to score a minimum score in this test. Currently there are five IITs or Indian Institute of Information Technology and thirty National Institutes of Technology that accept AIEEE score. The test is usually held in April, while the results are declared in the end of  May or beginning of June. Ranks are awarded to the candidates on either state basis or all India bases, also abbreviated as SR and AIR, respectively.",
            "eligibility": "A candidate is required to pass the final exam of 10+2 or must have cleared an equivalent qualifying examination, which is the minimum academic qualification required to appear in AIEEE. Candidates who are still appearing for their exam of 10+2 can also take AIEEE, while the criteria to be followed for getting admission in a university or institute is set by the concerned institution or university. Besides this, an upper age limit of 25 years has been set in order to determine the eligibility of aspirants. A relaxation of five years has been given to PH/SC/ST candidates. Aspirants are given three consecutive attempts to clear this entrance examination."
        },
        {
            "name": "JEE Main",
            "syllabus": "The syllabus of JEE Main Exam is released by Central Board of Secondary Education (CBSE) with Paper-1 and Paper-2. The entire course of studies is designed for aspirants of B.E or B. Tech, B. Arch and B. Planning. Students of B.E or B. Tech can opt for online or offline to take admission in various engineering colleges. But B. Arch and B. Planning students have only offline option to appear for JEE Main Exam.",
            "description": "JEE Main Exam is a gateway to take admission in any reputed and premiere engineering colleges from IIITs to NITs and from CFTIs to IIEST Shibpur. Now various questions can arise. Can all students get chance to take admission in engineering colleges through Joint Entrance Examination?",
            "eligibility": "Eligibility criteria for appearing Joint Entrance Main Exam depends on various factors like age, appearance in qualifying exam and number of attempts. The date of birth of candidates should be on or after 01/10/1990 if belong in General or OBC category. But SC, ST and PwD candidates are eligible if they have been born on or after 01/10/1985. Each candidate can attempt maximum three times for appearing the Joint Entrance Examination Main."
        },
        {
            "name": "JEE Advance",
            "syllabus": "The JEE Advanced exam syllabus is based on the 10+2 or Higher Secondary Science and Mathematics syllabus. The candidates must be able to recollect and use that knowledge gained in their High school Science and Mathematics learning to crack the JEE Advanced exam.",
            "description": "JEE Advanced is an engineering entrance exam usually conducted for students aspiring to get admission into the engineering colleges of India. The exam is conducted in both online and offline mode. The IITs, NITs, all Central government funded engineering colleges and a few private colleges also participate in this mega entrance exam to identify eligible students to be taken in to their prestigious institutions.",
            "eligibility": "The candidate should be 15+ years of age for the GEN or OBC-NCL category and 30 years of age for the SC, ST or PwD category. Candidates who have passed their Higher Secondary exams or appearing for the same are eligible to apply. Only students who have studied five subjects in their qualifying exams are eligible to apply and only three attempts per candidate is permitted"
        },
        {
            "name": "ILSAT",
            "syllabus": "Syllabus:Engilsh Language Test\nGeneral Knowledge\nLegal Aptitude Test\nNumerical Ability\n Logical Reasoning",
            "description": "The ILSAT Entrance Exam is an entrance examination conducted by ICFAI or the Institute of Chartered Financial Analysts of India for the enrollment of students into their law degree programs. ICAFI is an institute that functions as a non-profit University and has the approval of the University Grants Commission. The ILSAT Entrance Exam is for their Law School located in Dehradun. The Law School offers admission to their BBALLB (Hons) course which is a 5 year integrated course. There are other courses in Law offered by the Institution.",
            "eligibility": "Admission to the 5 year integrated courses are offered to students who have successfully completed the ILSAT Entrance Exam. To be eligible to write the entrance exam students must have passed the 10+2 or the Higher Secondary examination at the school level with a minimum of 50% marks in the aggregate of the qualifying examination. Other options that students can avail to be eligible for the ILSAT Entrance Exam is to produce the scores of the Law Entrance Tests conducted at the State or the National Level. It is an added advantage to have the CLAT scores."
        },
        {
            "name": "CMAT",
            "syllabus": "The exam syllabus for CMAT covers Mathematical Skills, English Comprehension, Logical Reasoning and General Awareness.",
            "description": "CMAT or Common Management Aptitude Test is a national level online admission test conducted by the AICTE (All India Council for Technical Education). This bi-annual examination is held in the months of February and September. CMAT qualifies a candidate for admission to management courses (MBA or equivalent) in AICTE-approved B-schools and institutions across India.",
            "eligibility": "MBA, PGDM and equivalent:\nGraduates (with a minimum 3 year degree) in all disciples and institutions recognized by the HRD ministry of the Government of India are eligible to appear for CMAT examinations\nGraduate students awaiting results are also eligible to apply for the examination.\nApplicants need to have a minimum aggregate of 50% of marks in the qualifying examination to apply for the CMAT exams.\nCandidates in the reserved category need to have a minimum aggregate of 45% of marks in the qualifying examination to apply for the CMAT exams."
        },
        {
            "name": "CET",
            "syllabus": "The CET Entrance Exam Syllabus is based on the syllabus of the 10+ 2 or the Higher Secondary Science subjects and hence, the students are able to crack the exam quite confidently as they have just studied for their final examination of the qualifying exam. The problem is in the application type of questions which the students are unable to crack too easily as it is based on the theorems and equations studied as a theory in the qualifying exam but not practiced.",
            "description": "The CET or the Common Entrance Examination is a standardized procedure to identify the most deserving students to the colleges for higher studies in professional courses. The courses that students are tested for admission include Engineering, Medicine, Dental, Architecture, Management and other related courses. The CET is conducted for admission to colleges across India irrespective of the State in which the student is domiciled. Though the students are granted admission through the CET entrance exam, some of the colleges are affiliated with the State run Universities, some with Central Universities and some are Deemed universities. The CET is also an avenue through which the students can seek admission to the Premium institution like the NITs, IITs, IIMs and the IISCs.",
            "eligibility": "Candidates should be above 17 years of age\nShould be a citizen of India\nShould have studied and successfully passed the 10 + 2 course of study in School or the Higher Secondary.\nShould have studied Physics, Chemistry, Biology and Mathematics along with English as major subjects in the qualifying examination."
        },
        {
            "name": "CAT",
            "syllabus": "The exam syllabus for the quantitative aptitude section is purely based on the mathematics curriculum of grade 12 level. The questions aim at solving real time problems by the application of mathematics concepts. Logical reasoning questions, check the capacity of the student to evaluate problems with interpretation of tables, charts and graphs. The verbal ability section aims at testing the English language standards. Verbal logic pertains with the logical aspects of the language.",
            "description": "The CAT or Common Admission Test is the principal management entrance exam conducted on all India basis by Indian Institute of Management (IIM). IIMs constitute the leading management institutes in India which provide all possible services in various business and management areas. The CAT exam is organized by IIMs for the selection of students to business administration programs. Another trait about CAT exam is that the CAT scores can be used by Indian Institutes of Technology (IITs) and Indian Institute of Science (IISc) for the selection of students for their management courses as a substitute for the Joint Management Entrance Test (JMET). The attractive point about CAT exam is that it is a complete computer based test.",
            "eligibility": "The CAT exam is conducted for selection to the postgraduate management courses so the minimum eligibility criteria remain a three year undergraduate degree from recognized institutions. A candidate with a degree in any of the disciplines are eligible to apply for the CAT. A minimum of 50% marks should be secured by the candidate at their undergraduate level exam in order to satisfy the eligibility criteria for the same."
        },
        {
            "name": "CEED",
            "syllabus": "The examination is to assess the skills and aptitudes of the candidates. Design sensitivity, visual perception skills, creativity, drawing skills, communication skills and logical reasoning are the major areas. No books are recommended by the authority for the preparation of the exam. The question papers of previous years would help the students to understand the pattern of questioning.",
            "description": "Common Entrance Examination for Design (CEED) is conducted by IIT Bombay on behalf of the Ministry of Human Resource Development, Government of India. Qualifying CEED is one of the requisites for the admission for few of the Post Graduation programs and Doctoral programs of Design at major IITs and IISc institutes.",
            "eligibility": "Bachelor’s Degree (Engineering or Architecture or Design or Interior design) or equivalent program of 4 years after 10+2\nAny professional Diploma in Design (NID/ CEPT or equivalent program of 4 years after 10+2)\nBachelor in Fine Arts which is 4 years program after 10+2\nG.D. Art, a 5 year program that could be done after 10th, besides the professional experience of one year\nMaster’s Degree (Arts/ Science/ Computer Application), a 2 year program after 3 years degree"
        },
        {
            "name": "AIMA UGAT",
            "syllabus": "The basic entrance exam syllabus consists of curriculum of plus two level examination. Apart from that a proper vocabulary, comprehension, grammar and many related areas are to be covered in English language. For numerical and data analysis all the concepts and corresponding formulas must be thoroughly understood. Reasoning and intelligence syllabus consists of application level question from all types of numeric calculations. General awareness should be built up for current affairs including social, political and economic issues so as to easily handle general knowledge section.",
            "description": "The All India Management Association (AIMA) administers the Under Graduate Aptitude Test (UGAT), annually for selecting students for undergraduate courses like BBA, BHM, BCA, integrated MBA courses and many more. Along with UGAT form, UGAT bulletin is also available carrying all the details about universities accepting UGAT score. All these help to furnish idea about entrance exam and the choice of college one can opt for. Using the bulletin students are supposed to mark five colleges based on their choice. The marks attained in the test will be provided to the respective colleges along with another individual score card for the candidate.",
            "eligibility": "The minimum eligibility criteria for appearing in UGAT is plus two from a recognized institute. Students who have written or going to write their final higher secondary exams can apply for the entrance test."
        },
        {
            "name": "AIPVT",
            "syllabus": "The AIPVT Entrance Exam Syllabus consists mainly of subjects and topics of the XII Std Science subject like Physics, Chemistry, and Biology. The AIPVT Entrance Exam is conducted in both languages, English and Hindi and the syllabus can be viewed on the website of the Veterinary Council of India. English is also another subject that is examined.",
            "description": "The AIPVT is an acronym for All India Pre- Veterinary Test conducted for students aspiring to enroll in the various Veterinary Colleges and pursue related courses like Veterinary Science and Animal Husbandry. The AIPVT Entrance Exam is conducted under the aegis of the Veterinary Council of India and the test is conducted for the prescribed number of seats approximately 300 seats in the various veterinary colleges in the country which accounts for 15% of the seats at the All India level.",
            "eligibility": "The Bachelor’s Degree in Veterinary and Animal Husbandry is spread over a period of 5 years and an internship of six months needs to be compulsorily completed before the degree is awarded. The Eligibility criteria require all aspiring test takers be Indian Nationals. All applicants for the degree course must have compulsorily completed the 10+ 2 or the Higher Secondary course in the science stream with physics, chemistry and biology as their subjects along with English. The English Core Course that is prescribed by the NCERT is recommended and must have passed the English exam at the Higher Secondary level. The Eligibility criteria also require applicants to have completed 17 years of age and should not be older than 25 years as on the date of application."
        },
        {
            "name": "BITSAT Entrance Exam",
            "syllabus": "The BITSAT test is conducted on the basis of NCERT syllabus for 11th and 12th class.",
            "description": "About the BITSAT Exam: The Birla Institute of Technology and Science Admission Test (BITSAT) is the test conducted by the Birla Institute of Technology & Science (BITS), Pilani for admission for the to the Bachelor of Engineering (B.E) , Pharma and M.Sc. programs. In 2014, around 1.8 lakh aspirants appeared for BITSAT for around 2,000 seats available in various BE (Hons.) programmes at BITS, indicative of the level of challenge associate with the exam.",
            "eligibility": "Must have completed their 10+2 from a recognized Board in the country in the year of the test or the preceding year.\nMust have secured a minimum of 75% in aggregate in the subjects of Physics, Chemistry and Mathematics / Biology.\nIn addition, must have secured a minimum of 60% in each of these subjects separately.\nMust be proficient in English."
        }
    ],
    "competitive": [
        {
            "name": "GRE",
            "syllabus": "Verbal Reasoning, Quantitative Reasoning and Analytical Writing are the three sections that cover the exam content. The exam is designed as test-taker friendly which provides flexibility to choose the questions to answer first. The exam takes 3 hours 45 minutes with six sections. 10 minutes break would be given after third section. Time allotment for first section Analytical Writing is 60 minutes which means 30 minutes for each task, 60 minutes for Verbal reasoning which includes 40 questions, 70 minutes for Quantitative Reasoning. Two other sections which are not counted in the score may appear which are for ETS research purpose and for comparing with earlier or later edition test scores.",
            "description": "GRE exam is organized by Educational Testing Service (ETS) since 1949. The exam is computer based conducted in around 1000 test centers in around 160 countries. It is also conducted as paper based test in such areas where the test couldn’t be taken computer-based. With around seven hundred thousand annual test takers, it is one of the exams written by majority of students.",
            "eligibility": "Though there is no official eligibility, it is meant for Bachelor degree holders and Final year Degree students. Good knowledge of English is expected. The exam can be taken number of times in a year. The best score can be submitted to the applying college or University. The validity of the score is 5 years."
        },
        {
            "name": "GATE",
            "syllabus": "The Computer based test includes multiple choice questions and numerical answering questions. With total 65 questions, the exam is for 100 marks. 10 questions of General Aptitude which carries 15% of total marks are compulsory for all disciplines. With 3 hours time duration, the exam would be scheduled on Saturdays and Sundays in shift basis at the mentioned centers.",
            "description": "It is a computer based standardized test, conducted to test the skills and knowledge of chosen discipline of Engineering and Science at undergraduate level. It is conducted by Indian Institute of Science and Few Indian Institutes of Technology, collectively for National Coordination Board – GATE since 1984. It is conducted once in a year over 660 centers chosen over India. With 15% of average pass percentage, the examination is one of the prestigious qualifications for many of the students.",
            "eligibility": "The students of final year or the students who are qualified of Bachelor’s Degree of 4 years or any equivalent in Engineering or Architecture are eligible to attempt the exam. Even those who qualified or those in final year of Master’s Degree in Science or Mathematics or Computer disciplines are also eligible."
        },
        {
            "name": "SAT",
            "syllabus": "The major skills which are taught in the schooling are tested in SAT. Critical reading, writing and mathematics are the major sections in which the student is assessed. These three major sections further divided into three parts with sub sections. The score is considered in scales. The time to complete the test is 3 hours. From 2016, the essay is optional with additional 50 minutes to complete. There is negative marking for incorrect answer.",
            "description": "SAT stands for Scholastic Aptitude Test. A private nonprofit organization of United Stated, College Board started the exam in 1926. Educational Testing Service conducts the exam on behalf of College Board. The exam is conducted worldwide is conducted seven times a year in the United States and six times though out the world. With around 1.7 million candidates, SAT is one of the eminent exams conducted over the world.",
            "eligibility": "Completion of high school is the general academic eligibility, though the eligibility criterion is not mentioned. Good knowledge of English is expected. Those who schooled at home are also eligible for the exam."
        },
        {
            "name": "TOEFL",
            "syllabus": "In speaking section, with time limit of 20 minutes, 6 tasks are to be completed which include expressing opinion of a well known topic, speaking about the reading and listening tasks etc. In writing session, with in 50 minutes, 2 writing tasks are to be completed.",
            "description": "TOEFL is conducted by Education Testing Service. It is one of the major Standard English Language Tests which is accepted by many universities around the word, majorly universities of US. The test is initiated by ETS in the year 1964 and is modified as per the contemporary requirements. With the validity of 2 years, the exam can be taken as many times as the candidates wishes. Minimum duration between the exam and retaking exam must be 12 days. The test is conducted around 50 times per year.",
            "eligibility": "There is no particular eligibility requirement. The exam is intended for the candidates who are non-native English speakers. No restrictions are quoted by ETS regarding the minimum and maximum age and the qualifications. Yet, passing in 10+2 is generally considered to meet the standard of the exam."
        },
        {
            "name": "NET",
            "syllabus": "The examination consist three papers conducted in two sessions of a day. All the three papers are objective typed. There is no negative marking. Each question carries 2 marks.\nFirst Paper tests the reasoning ability, comprehension skills and general awareness of the candidate. Out of 60 multiple choice questions, candidate has to answer any 50.",
            "description": "National Eligibility Test (NET) is aimed to award Junior Research Fellowship and eligibility for Associate Professor or Lectureship in all the Universities and Colleges of India. The exam is conducted twice a year. Currently, the examination is conducted by Central Board of Secondary Education on behalf of Union Grant Commission (UGC).",
            "eligibility": "The academic eligibility criterion is pursuing Master Degree or equivalent exam in the listed subjects with 55% without rounding off and it is 50% for SC, ST, PWD and OBC candidates. Marks relaxation is also applicable to the Ph.D. degree holders who have completed their Master’s Degree before 19th September 1991, for attempting the NET exam."
        },
        {
            "name": "Civil Services IAS Exam",
            "syllabus": "With nine papers, two are just for qualifying and seven are considered for ranking, the Main examination has total marks of 1750. The examination tests various topics of general studies like Indian Heritage and Culture, Indian History and Geography, Geography of the World, Constitution, Technology, Disaster Management, Economic Development, Ethics etc. Choice of selecting one subject from the specified subjects is provided for the last two papers.",
            "description": "Civil Services Examination (CSE) is conducted by Union Public Service Commission with the aim of recruiting personnel in Civil Services of Government of India. One of the major sectors is Indian Administrative Service (IAS). The examination is considered as one of the prominent and toughest examination with a least success rate.",
            "eligibility": "As per the revised age limits, the minimum eligible age is 21 years for all candidates. The upper age limit varies as per the category. For General category it is 32 years, for OBC it is 35 and for SC/ST the upper age limit is 37 years. Even the number of attempts also varies as per the category. 6 attempts for General category, 9 for OBC and there is no restriction for SC/ST candidates."
        },
        {
            "name": "Combined Defense Services Exams",
            "syllabus": "Examination is conducted in objective type. Major subjects tested are English, General Knowledge and Elementary Mathematics. Each subject carry 100 marks each and the total marks are 300. For Officers’ Training Academy, only English and General Knowledge are tested for 200 marks. The standard of the Elementary Mathematics is Matriculation level and of other subjects is of Graduation. The duration of the exam is 2 hours for each subject. There is negative marking for wrong answers.",
            "description": "Combined Defence Service Exam is conducted by Union Public Service Commission as part of the recruitment in Military, Naval and Air Force Services. The exam is conducted twice a year, usually during November and February. Female are recruited for Non-technical services and unmarried men are for the others services.",
            "eligibility": "The age eligibility for Indian Military Academy and for Indian Naval Academy is 18 to 23 years. For Air Force Academy, it is 20 to 24 and for Officer’s Training Academy, it is 18 to 24 years. For women candidates, age eligibility is 18 to 24."
        },
        {
            "name": "GMAT",
            "syllabus": "The exam contains four sections – Analytical Writing, Integrated Reasoning, Quantitative and Verbal sections.",
            "description": "Graduate Management Admission Test (GMAT) is conducted by Graduate Management Admission Council (GMAC). It is a computer based standardized test. It tests reasoning and analytical skills of the candidate but not the business related skills. The examination has been initiated since the year 1953. The exam is offered multiple times a year. The exam is conducted in 600 examination centers in around 114 countries. The validation of the score is for 5 years.",
            "eligibility": "There are no official eligibility criteria for the exam. Though the exam is mainly intended for the candidates who completed the Graduation course, candidates of below 18 years can also take the exam for practice purpose. Those who are below 18 of age must provide parent consent form which can be downloaded from the official website. Proficiency in English is expected."
        },
        {
            "name": "National Defense Academy Exam",
            "syllabus": "Algebra, Matrices and Determinants, Trigonometry, Analytical Geometry, Differential Calculus, Integral Calculus and differential equations, Vector Algebra, Statistics and Probability are the major topics in Mathematics. English, General Knowledge that include the subjects Physics, General Science, Chemistry History, Geography and Current Events are tested in General Ability Test.",
            "description": "National Defence Academy Test is the entrance exam to join National Defence Academy (NDA). The exam is conducted twice a year by Union Public Service Commission. The exam is conducted in most of the major cities all over India. Academy doesn’t take any kind of responsibility regarding the exam. Thus, they clearly state not to contact the Academy regarding any information in respect of the entrance exam, interview and the results. Around 350,000 applicants appear for the exam.",
            "eligibility": "Only unmarried male candidates are eligible for the exam. The age must be between 15 to 18 years. Class 12 is the academic eligibility for the entrance exam. Students appearing for class 12 examinations are also eligible. Candidates are expected to be physically fit and meet the physical standards."
        },
        {
            "name": "State Bank Of India Probationary Officers Exam",
            "syllabus": "Selection procedure includes three states – Preliminary Examination, Main Examination and Group discussion & Interview.",
            "description": "State Bank of India Probationary Exam is conducted by Central Recruitment and Promotion Department of State Bank of India (SBI). State Bank of has the history of 200 years. Probationary Officer is the Junior Management Level. SBI recruits its personnel through its own channel of recruitment process. The number of chances to appear for the exam 4 for General Category and 7 for OBC/PWD and no restriction for SC/ST.",
            "eligibility": "Graduation in any discipline from a recognized University or its equivalent is the educational qualification. Final Year Graduation Students also can apply on the condition of submitting the proof of having passed during the time of interview.\nMinimum age limit is 21 and maximum age limit is 30. The upper age limit is relaxed for certain categories like SC/ST, OBC, PWD, Ex-servicemen etc."
        },
        {
            "name": "LIC Officers Exam",
            "syllabus": "Section 1 is Reasoning Ability of 30 questions carrying 90 marks, Section 2 is Quantitative Aptitude of 30 questions carrying 90 marks, Section 3 is General Knowledge and Current Affairs of 30 questions carrying 60 marks, Section 4 is Computer Knowledge of 30 marks carrying 60 marks and Section 5 is English Language with Special emphasis on Grammar, Vocabulary and Comprehension of 40 questions.",
            "description": "Life India Insurance recruits officers every year through the Exam. It is one of the largest Government of India owned Insurance Company. The examination is usually notified during the month of January and the written exam is held during the month of February.",
            "eligibility": "Minimum age limit is 21 and maximum age limit is 30 years. Upper age limit is relaxed for few of the categories. Candidates must possess relevant graduation to the applying post. Example: a Bachelor or Masters Degree in any of the discipline from a recognized University is required for Generalist Assistant Administrative Officer; an Associate Membership of the Institute of Chartered Accountants of India is required for Chartered Accountant Assistant Administrative Officer. Computer proficiency is compulsory for all streams."
        }
    ]
}