{
    "pg": [
      {
        "name": "MBA or Business Courses ",
        "duration": "2 years",
        "description": "MBA is one of the most popular PG Course in India. You can pursue MBA after engineering, commerce course or even a medical course. There is no entry restriction in MBA, and there are various domains available as well. The common domains available are Finance, Marketing, HR, Operations, Communications, IT & even Telecom. Pursing MBA will help you in gaining knowledge about running the business. You can choose the specialization according to your interest or according to your interest. The course if of 2 years and the general examinations to get admission in MBA are CAT, GMAT and NMAT. Some of the universities have individual examinations. Our recommendation here is to pursue an MBA from an elite institute as this will enable you to get admission with ease. If you are not interested in the MBA, then you can also pursue other management or business related courses, and that would offer you a similar experience or exposure."
      },
      {
        "name": "M.Tech or M.Sc / M.Arch",
        "duration": "4 years",
        "description": "We have talked about the MBA, but what if you are inclined towards science and technology? Well, in that case, you can opt for M.Tech or M.Sc in the domain that you love. These two are quite popular courses in India. The admissions for M.Tech are usually through GATE exam, and for M.Sc., there are entrance exams as well as admissions on merit bases. Delhi University is also top-rated for B.Sc. as well as M.Sc. If you would like to pursue M.Tech from an elite university, then you can also go ahead and choose IIT. It certainly takes a lot of hard work to get into the IIT. If you are pursuing M.Tech, you will get a chance to teach the class of B.Tech student, and if you wish to study more, you can pursue a PhD as well. The same growth path is for M.Sc. as well. Since the M.Tech and M.Sc. are the specialized courses, it is easy to find a job in that particular domain. If you have done a course in architecture, then you can even go ahead and pursue M.Arch as your PG Course."
      },
      {
        "name": "MCA or Computer Courses",
        "duration": "3 years",
        "description": "Many times, students develop affection for computer programming. If you also developed such affection and if you pursued BCA then you can go ahead and opt for MCA as your PG Course. The duration of MCA is two years, and once you complete it, you can quickly get a job that any B.Tech Developer would do. If you do not wish to pursue MCA, then you can even choose a PG in any other IT domain. Cyber security remains to be in the highest demand. With a PG course in computers, you can tap the Indian IT Industry. The growth curve is also quite remarkable in this industry. We recommend you to research about the MCA and other computer courses as this is one of the most employable PG Course available in India."
      },
      {
        "name": "Post-Graduation in Economics",
        "duration": "3 years",
        "description": "Bachelor in Economics has gained a lot of popularity, and people who love economics as a subject would surely be willing to do a PG Course in Economics. For them, there are multiple options available as well. Delhi University and a lot of other reputed university offers a PG Course in Economics. It is easy to find a job after completing the course. In addition to this, you can also study for administrative positions with the government of India. A lot of banking and insurance jobs also hire students who have completed the PG Course in Economics."
      },
      {
        "name": " Masters in Arts, Hotel Management, Tourism",
        "duration": "2, 3, 3 years",
        "description": "If you have completed your BA, then you can also opt for a Masters in Arts. You can choose your domain according to your interest. Apart from this, there are Master courses available in the hospitality sector as well. These courses will bring you close to being a Subject Matter Expert. You can even start your travel agency by pursing a course in Hospitality or Tourism Industry. The margins are usually very high, and you can count on your fixed client base for the regular income. All the courses in this field are in high demand. People do not look down on humanities anymore, and they know that these courses have endless potential."
      },
      {
        "name": "Post Graduate in Cyber Law / LLM",
        "duration": "2 years",
        "description": "In India, there is a lot of potential in the legal domain. If you have completed your LLB, then you can go ahead and pursue LLM. This will open a new horizon for you. If you are not interested particularly in LLB, then you can also go ahead and pursue other courses in the law domain. One of the trending domain here is cyber law. With digitalization, cyber frauds are always on the rise, and many people are in search of lawyers who understand technology. Understanding technology is an add-on while you are trying to make a career in law. The field offers a lot of respectable jobs, and the good thing is that a lot of corporate houses also employ lawyers that have specialization in cyber law or that have a PG degree in the field."
      },
      {
        "name": "M.Com",
        "duration": "2 Years",
        "description": "If you have completed your B.Com, then you will have a lot of opportunities available to work. You can easily find a job, but it is always better to go ahead and pursue masters as well. If you would like to stay in your field, then you can pursue M.Com. M.Com stands for Masters of Commerce, and it is a two-year course. The course will help you in gaining specialization in the field, and you will be able to enhance your pay scale easily. If you want, you can even pursue M.Com from an open school, and this way, you will gain your PG degree while you are earning money. So, you can choose between a full-time course and a correspondence course."
      },
      {
        "name": "Masters in Medical Science",
        "duration": "2 years",
        "description": "If you enrolled in MBBS for your Graduation, then we are sure that you would be aware of the host of options available to you for post-graduation. You can do your MD in any particular field that has your interest. You can also opt for foreign universities for residency courses. There are many advantages of pursuing Masters after MBBS. The first advantage is that you get specialization, and this helps you in being the master in your field. The second benefit is that you can continue your masters while treating patients. This means that you can fund your education, as you will continuously be earning while studying. Moreover, you will be doing a noble job by serving society. If you are a dentist, then you can even go ahead and pursue masters in the same field."
      },
      {
        "name": "PG Diploma Broadcast/Journalism",
        "duration": "1 years",
        "description": "The Bachelor Programs in Journalism and Mass Communication are always in huge demand. You can quickly get a job after the bachelor program, but what if you wish to grow further? Well, in such a case, you can go ahead and pursue a PG Course in Journalism, Mass Communication or Broadcast. You can even do this course after pursuing a course like English Honors. The field is open for people from multiple backgrounds, and it has roles for almost everyone. If you are fond of media and if you would like to make a career in the field then we would recommend you to choose a PG Course in Journalism, and you can pursue this course while working at a media house. You can even pursue an MBA in Mass Communication as many institutes in India offer this kind of course as well."
      },
      {
        "name": "Masters in Design/Fashion",
        "duration": "2 years",
        "description": "If you have been through our article where we talked about the best undergraduate courses available in 2021, you would have noticed a section for Fashion Designing and Designing Courses. If you already have a Bachelor degree in Design or Fashion, then you would surely be aware of the magnitude of the industry. You would know the kind of opportunities and demand in the industry. To polish your skills further, you can pursue a masters, and it will help you in gaining in-depth knowledge of the industry. There are a lot of options available for Masters and a lot of people also prefer pursing these courses from European Universities or British Universities. Even in India, you have a lot of options, and it is worth researching a little about prospects. You can certainly make a very successful career in this field, and the PG Course will enable you to take a step ahead."
      }
    ],
    "ug": [
      {
        "name": "Bachelor Of Arts (B.A)",
        "duration": "3 years",
        "description": "The B.A Courses or the Bachelor of Arts Courses is one of the basic courses when pursuing higher studies. In fact, earning a BA Degree was once seen as a sign of high scholastic abilities. Today with the spread of education and the increase in the number B.A Courses, it is common to find a person having a BA Degree.\nThe B.A Courses can be taken in a wide range of subjects that include Humanities, Arts, Music, Dance, Languages, Literature and Education. Today there are even more disciplines with long lists of subjects attached to them."
      },
      {
        "name": "Bachelor Of Arts Bachelor Of Law (B.A.B.L)",
        "duration": "5 years",
        "description": "The B.A.B.L Courses are highly regarded profession in the field of Law. The candidate who completes the B.A.B.L Courses receives a Postgraduate Certificate at the end of the integrated course. The degree course of the B.A.B.L Courses is an Honours Degree. The LLB is a course done after the BA Honours Degree in general cases, but in this case the honours BA degree and the LLB law degree go side by side and by the time the course ends, the candidate has both the Honours Undergraduate Degree and a Postgraduate Degree.\nThere is a condition on the age limit which is that the candidate must be of 20 years of age as of 1st June of the year of joined."
      },
      {
        "name": "Bachelor Of Applied Sciences (B.A.S)",
        "duration": "4 to 5 years",
        "description": "The Bachelor of Applied Science, often abbreviated as B.A.S is a highly advanced course in Science. There are many abbreviations to it and one of them is the B.AS by which it is commonly referred. This is a professional degree and has more weightage than the B.Sc. or the Bachelor of Science degree. The B.A.S Courses in most cases is the end of an academic phase and after acquiring this degree most students do not go on to take the Master’s unless in very rare cases. The B.A.S Courses basically allow the student to become a professional in the field of science. It is more vocational in nature, but since it is a Bachelor’s Degree it is considered to be of high value. The study of the B.A.S Courses enables students to have an advanced knowledge in their chosen subject and seek a higher position in their employment."
      },
      {
        "name": "Bachelor Of Architecture (B.Arch)",
        "duration": "5 years",
        "description": "The B.Arch. Courses or the Bachelor of Architecture is a highly professional course. It is an undergraduate course conducted by many Professional colleges in India. The B.Arch. Courses are either conducted by colleges and universities dedicated to the study of architecture or have a school of architecture as part of the discipline in which education is imparted. This course can be further enhanced with a Postgraduate Degree in Architecture and even further with P.HD in any of the specialized fields of Architecture. The B.Arch. Courses are conducted in different colleges and universities that range from the Central and the State and the Deemed and Private universities"
      },
      {
        "name": "Bachelor Of Business Administration (B.B.A)",
        "duration": "3 years",
        "description": "The B.B.A Courses are one of the relatively new courses that have been introduced as a discipline of study in the undergraduate degree programs. The B.B.A Courses are the Bachelors in business Administration and this is a very good subject to take up if one is planning to pursue the Business Administration studies at the postgraduate level.. The B.B.A Courses usually include Commerce, Business Studies, and related subjects in both the areas of study."
      },
      {
        "name": "Bachelor Of Business Management (B.B.M)",
        "duration": "3 years",
        "description": "The B.B.M Courses or the Bachelors in business management is an undergraduate degree course that prepares the students with the organizational work culture. The program encompasses the subjects of business, finance, management, Human resources, marketing, Economics and adversities. Norms of organizational behavior are also extended to student undertaking the course. The education in new methods followed in the work culture in organizations is extended to students and they are exposed to the computer systems which is an integral part of every organization today. The syllabus for the B.B.M Courses is covered over a period of 6 semesters or 3 years."
      },
      {
        "name": "Bachelor Of Engineering (B.E)",
        "duration": "4 years",
        "description": "A student who has passed the Higher Secondary Examination or the 10+2 State Board Examination are eligible to seek admission. The students to be eligible to pursue B.E Courses should have passed with Physics, Chemistry and Mathematics with a minimum aggregate marks of 55%. This is subjected to change for respective Universities/Colleges. Diploma holders are given lateral entry admission directly to the second year."
      },
      {
        "name": "Bachelor Of Dental Surgery (B.D.S)",
        "duration": "5 years",
        "description": "The B.D.S Courses is made up for 8 semesters with the first few semesters being that of a medical course and the remaining semesters are dedicated to the study of the dentistry and its related branches of study. Lectures, group discussions, practical and clinical experiences are some of the needs of the B.D. S Courses and which the student needs to fulfill as part of their training program. Some of the treatment processes are introduced to the students and they are required to study the basics of those treatment processes. The modern day treatment processes like orthodontics, periodontics and cosmetic surgery are some of the other parts of the B.D.S Courses."
      },
      {
        "name": "Bachelor Of Design (B.Des)",
        "duration": "4 years",
        "description": "The B.Des Courses or the Bachelors in Design courses is an academic degree awarded at the undergraduate level. Though it is related to the arts and centered on creativity and artistry, the degree is awarded for those who have excelled in the art of designing. In this case the designing of anything ranging from textiles, fashion and jewelry to games, graphics and multimedia are included among others. The degree is also known as the Bachelors in Design Studies and the Bachelors in Design Arts. The other name for the B.Des Courses is B.D. Courses which encompasses even more subject areas. Since the field of designing is immensely vast, there is no limit to what the student with a degree in the B.Des Courses can learn to design."
      },
      {
        "name": "Bachelor Of Arts (B.A)",
        "duration": "3 years",
        "description": "The B.A Courses or the Bachelor of Arts Courses is one of the basic courses when pursuing higher studies. In fact, earning a BA Degree was once seen as a sign of high scholastic abilities. Today with the spread of education and the increase in the number B.A Courses, it is common to find a person having a BA Degree.\nThe B.A Courses can be taken in a wide range of subjects that include Humanities, Arts, Music, Dance, Languages, Literature and Education. Today there are even more disciplines with long lists of subjects attached to them."
      }
    ],
    "law": [
      {
        "name": "B.Sc. LL.B.",
        "duration": "5 years",
        "description": "This is a specialization for the basic certificate Law Courses in India L.L.B program. The course covers firstly a bachelor's in science and then brings in the specialization of law. The course has many benefits as it may help to deal with related Laws and their rulings.\nThose graduates in this field come up with a specialization in law for the field of science.\nIt covers the subjects of crucial level which are Legal Method, Law of Contract with those of science such as concepts of chemistry. Other subjects include English and Legal Language, Biotechnology and Cell biology, etc.\nEligibility:Those that have cleared off their 12th with the backdrop of PCMB. They are to clear off their entry test as of law as well."
      },
      {
        "name": "B.Com L.L.B",
        "duration": "5 years",
        "description": "The pupil that has cleared off their classes in commerce and wants to continue it but wants to pursue Law has this option.\nThe courses are cleared off as both of commerce and laws. The subjects are very varied and interesting. This course gives an insight into commerce, banking, and business and its laws.\nEligibility:Those that cleared off their entry test of law are applicable. Those that form the backdrop of commerce. And those that have completed the 12th can apply."
      },
      {
        "name": "Bachelor Of Laws [L.L.B.]",
        "duration": "3 years",
        "description": "This is Law Courses after 12th complete in 3 years.\nThere are two types of Law one is 3 years which is done after graduation and another one is 5 years for undergraduate students.\nThe semesters are divided into 6 sections.\nCandidates get admission to Government College as well as a private college.\nDifferent universities have different eligibility criteria for this course."
      },
      {
        "name": "Bachelor Of Arts + Bachelor Of Laws [B.A.L.L.B.]",
        "duration": "5 years",
        "description": "This is the most basic and the most popular course of L.L.B. People opt for this as this is simple and has more scope with law. It is not bound to commerce or science laws but the laws of all. This is also known as simply L.L.B rather than any specialization.\nEligibility:Anybody that has done a simple 12th Pass from any backdrop. Those that clear off their entry test of law from any level."
      },
      {
        "name": "Diploma in Taxation Law [DTL]",
        "duration": "1 year",
        "description": "This Law course complete in 1 year. Students who passed 12 standards are eligible for this program. \nMost students after graduation, pursue these programs because this degree is providing basic taxation knowledge and its related field.Eligible students can get admission to the program.\nThe average amount of this course Rs 5000 and 2 Lacs.Every college has its own eligibility criteria, admission process, and fee structure. DTL is a Diploma level income tex commerce diploma program"
      },
      {
        "name": "Diploma In Cyber Law",
        "duration": "1 year",
        "description": "It is a 1-year Law course in diploma  Candidate must pass 10 and 12 standards through the reputed school and must secure 50% marks.\nSince many universities in India offer this course for students.\nThe range of the amount approximately Rs 26000 to 85000  and is also based on the duration. "
      },
      {
        "name": "Diploma In Labour Laws And Labour Welfare",
        "duration": "1 year",
        "description": "Candidates must be passed 10 and 12 standards through the reputed school and must secure 50%.\nFor admission students have to attend the entrance test or else the admission will be done according to eligibility criteria.\nThe range of the amount approximately Rs 33000 to 78000."
      }
    ],
    "phd": [
      {
        "name": "PhD in Chemistry",
        "duration": "3 to 6 years",
        "description": "Full Form: Doctor of Philosophy in Chemistry\nEligibility: Masters degree\nPHD Chemistry Admission: Entrances + the candidates should have cleared the Entrance test conducted by the respective university.\nTop Entrance Exams: UGC-NET, GATE, CUCET, etc.\nPHD Chemistry Syllabus: General Structure, Research Methodology, Scientific Communication, Recent Trends in Chemistry,etc.\nPHD Chemistry Fees: INR 80,000-3 LPA\nPHD Chemistry Salary: INR 15 - 20 LPA\nPHD Chemistry Jobs: Staff scientist, Chemist, Chemistry Professor, Research Specialists, etc. etc\nRecruiting Areas: Staff scientist, Chemist, Chemistry Professor, Research Specialists, etc"
      },
      {
        "name": "PhD in Mathematics",
        "duration": "3 years (Full Time)",
        "description": "The minimum Eligibility required is M.Sc. Degree in Mathematical or Physical Sciences/ B. Tech Candidates from any discipline with a minimum of 55% score.\nAdmission Process: Both Entrance Exam and Merit-Based.\nTop Ph.D. Mathematics Entrance Exams: NBHM Entrance Exam, CSIR UGC NET, UGC NET, and other relevant entrance exams.\nTop Universities and Colleges: Amity University, IISc (Bangalore), Stella Maris College, Banaras Hindu University, Presidency College, Aligarh Muslim University, and other popular universities and colleges.\nDistance Education/Correspondence: No\nCommon Jobs after Ph.D. Mathematics: Mathematician, Statistician, Loan Officer, Accountant, Economist, Demographer, Researcher, Personal Banker, Cryptographer, Demographer, etc."
      },
      {
        "name": "PhD in Physics",
        "duration": "3 years (Full Time)",
        "description": "PhD Physics Eligibility: Minimum of 60% aggregate or equivalent CGPA (relaxed to 55% or equivalent CGPA for SC/ST) in post graduation.\nAdmission Process: Entrance Exam and Merit-Based.\nTop PhD Physics Entrance Exams: IIT JAM, CSIR UGC NET, UGC NET, and other relevant entrance exams.\nTop Universities and Colleges: Indian Institute of Science, IITs, Birla Institute of Technology and Science, Loyola College, Christ University, Chandigarh University\nDistance Education/Correspondence: Distance education through IGNOU is only accepted.\nCommon Jobs after PhD Physics: Researcher, Scientist, Physicist, Lecturer & Professor, Author & Writer, Journalist, Editor & Critic, Human Services Worker, Independent Consultant, Philosophical Journalist"
      },
      {
        "name": "PhD in Biotechnology",
        "duration": "3 to 6 years",
        "description": "Minimum Eligibility: Masters in Biotechnology/Bioinformatics along with an aggregate of 50% marks.\nAdmission Process: Entrance Exam followed by Interview.\nTop Entrance Exam: UGC-NET, UGC-CSIR-NET.\nTop Colleges: St. Xavier’s College Kolkata, Stella Maris College Chennai, Women's Christian College Chennai.\nAverage Annual Fees: INR 50,000 to INR 4,00,000.\nTop Career Prospects: Assistant Professor in Biotechnology, Biochemist, Medical Scientist, Microbiologist, Biomanufacturing Specialist, Product manager, Medical Communication Specialist, etc.\nAverage Annual Salary: INR 4,00,000 to INR 20,00,000."
      },
      {
        "name": "PhD in English",
        "duration": "3 to 6 years",
        "description": "PhD English Eligibility: Masters degree + the candidates should have cleared the Entrance test conducted by the respective university.\nAdmission Process: Entrances.\nTop Entrance Exams: CSIR UGC NET, UGC-NET, GATE, SET\nPhD English Colleges: Christ University, Shiv Nadar University SNU, Chhatrapati Shahu Ji Maharaj University CSJMU, The Northcap University NCU, Central University of Rajasthan CURAJ\nPhD English Fees: INR 50,000 - 5 LPA\nPhD English Salary: INR 4 to 8 LPA\nPhD English Jobs: Senior Research and Development Manager, Assistant Professor, Head of the educational department, Philosophical/ Literature Researcher, Political Advisor, etc"
      }
    ],
    "diploma": [
      {
        "name": "Interior Design",
        "duration": "1-2 years",
        "description": "In simple terms, interior design is the art and science of enhancing interiors and exteriors of buildings, space and built environment to boost its aesthetic appearance. An interior designer is a professional who is knowledgeable about topics like planning, functional design, interior decoration and optimal use of space."
      },
      {
        "name": "Fashion Design",
        "duration": "1-2 years",
        "description": "Fashion designing deals with the following things/aspects – planning, designing, creating and presenting clothing and accessories. The training program covers topics such as – dressing materials, concepts of design, sketching, CAD, fashion merchandising, fashion communication, relevant equipment etc."
      },
      {
        "name": "Jewellery Design",
        "duration": "1-2 years",
        "description": "Modern-day jewellery designers rely on computer software for designing jewellery and accessories. They use CAD software to carry out the task of designing. Despite the use of CAD and computers, designers skill sketch their designs of paper using a pencil. Having decent drawing skills will help you thrive in this profession."
      },
      {
        "name": "Event Management",
        "duration": "1-2 years",
        "description": "Events can broadly be classified into the following types – personal events, corporate events, social events, sports events, political events, exhibitions etc. Marriage functions or birthday celebrations are examples of personal events. Political gathering or meeting is an example of political event. Sports tournaments are examples of sports events."
      },
      {
        "name": "Health and Applied Sciences",
        "duration": "3 years",
        "description": "This diploma course deals with domains such as – health science, applied sciences and allied fields. When it comes to health and applied sciences education, Bachelor’s Degree courses have dominated the scene for long. B.Sc. Health Science and B.Sc. Applied Sciences courses still are very popular among students. While this Diploma course is not as valued as its B.Sc. counterparts, it still is job oriented!"
      },
      {
        "name": "Web Designing",
        "duration": "3 years",
        "description": "Diploma in Web Designing course will train you in areas such as – HTML, CSS, PHP, JavaScript, User Interface, Design, Layout and more. If you want to become a web designer, this training program will be of help to you!"
      },
      {
        "name": "Software Engineering",
        "duration": "3 years",
        "description": "After completing this course, you will become adept at different areas of software development. For example, after completing this course, you will be able to take part in software development projects, write code, develop software, test software etc. In short, this course will help you build a decent career in tech and IT industry. Software developers are also hired by other establishments such as – Government agencies, MNCs, business firms, digital media firms etc."
      },
      {
        "name": "Food Technology",
        "duration": "3 years",
        "description": "The main purpose of food processing technology is to make food edible. For example, consuming raw cattle milk can sometimes lead to unwanted health effects. Due to this reason, cattle milk is subjected to various processes and made ideal for consumption. The second main use of food processing technology is to transform food/ingredients/raw materials into familiar forms of food. For example – creating a loaf of bread from raw materials and grain."
      },
      {
        "name": "Computer Application (DCA)",
        "duration": "6-12 months",
        "description": "DCA stands for Diploma in Computer Application. As the name suggests, it is a Diploma program that deals with Computer Application. What is Computer Application, you may ask. This field of study deals with various aspects of computers. Some such important aspects are – Programming,Software,Hardware,Web Designing,Internet Technology,IT Systems,Network Technology,Cyber Security"
      },
      {
        "name": "ITES and Management",
        "duration": "3 years",
        "description": "ITES stands for Information Technology Enabled Service. It is a job oriented Diploma course related to BPO, KPO and IT sectors.This course is related to domains such as – IT, BPO and KPO. These sectors are known to generate ample amount of job opportunities in India. Thus, if you are looking for a job oriented Diploma course after 10th, this will be an ideal program for you."
      }
    ],
    "medical": [
      {
        "name": "Bachelor of Medicine, Bachelor of Surgery - MBBS",
        "duration": "5 years",
        "description": "Bachelor of Medicine, Bachelor of Surgery (MBBS) is one of the predominant medical graduate degrees for becoming a doctor. Approximately every candidate having a thought of medical courses, their first choice is to opt for MBBS as a medical course. It is a combination of two professional degrees in medicine and surgery offered by government and private colleges of the country. This is a 5.5-year duration course with Basic, Pre and Paramedical subjects. In the duration of five and a half years time span, students must complete a 12 months compulsory rotatory internship, which includes serving in hospitals.\nEntrance exam: National Eligibility cum Entrance Test (NEET) - National Testing Agency (NTA) will conduct NEET exam for admission to around 1,63,150 MBBS/BDS/AYUSH/BVSc&AH seats."
      },
      {
        "name": "Master of Surgery - MS",
        "duration": "3 years",
        "description": "MS (Master of Surgery) is a postgraduate degree and it is mandatory for students to complete their MBBS degree before proceeding for their MS degree studies. Master of Surgery is a three-year postgraduate medical course designed for aspirants to have comprehensive knowledge and skills in surgical training. Candidates pursuing an MS degree will go through the high quality health care details and the advancement in the cause of science and medical fields through having detailed research & training.\nTop entrance exam: NEET PG"
      },
      {
        "name": "Doctor of Medicine - MD",
        "duration": "3 years",
        "description": "MD (Doctor of Medicine) is a postgraduate degree, aspirants after pursuing MBBS degree can opt for this degree.To excel in the field of medicine, experts highly recommend candidates to opt for a Doctor of Medicine or MD degree for specialization in post graduation. These specializations include Radiotherapy, Anatomy and General Medicine. The degree duration of MD is three year.\nTop entrance exam: NEET PG 2021"
      },
      {
        "name": "Bachelor of Ayurvedic Medicine and Surgery - BAMS",
        "duration": "5 and half years ",
        "description": "BAMS is a professional medical course that focuses on the study of Ayurvedic medicine. The degree is awarded to students after successfully completing 5 and a half years of study including one year of internship. A graduate of BAMS is allowed to give medical treatment in some states of India after registering at a government-approved licensing authority. The course of BAMS provides complete knowledge about 'Ashtanga Ayurveda' along with scientific advances in modern medicine along with extensive practical training.\nEntrance exam: NEET"
      },
      {
        "name": "Bachelor of Homeopathic Medicine and Surgery - BHMS",
        "duration": "5 and half years",
        "description": "BHMS is an undergraduate degree in Homeopathy in India and it is awarded after the study for a duration of 5 and a half years which includes a one-year internship. Candidates choosing BHMS as their medical course can gain the knowledge of Homeopathy medicine along with the treatment. Candidates can opt for various specializations like Homeopathic Pharmacy, Paediatrics, Psychiatry, Skin specialist among others to treat the patients with Homeopathic knowledge.\nEntrance exam: NEET"
      },
      {
        "name": "Bachelor of Physiotherapy - BPT",
        "duration": "4 years",
        "description": "Bachelor of Physiotherapy or BPT is an undergraduate programme that deals with the structure of the human body. Bachelor of Physiotherapy (BPT) is a 4-year undergraduate course along with 6 months compulsory internship program that is also required to practice as a qualified physiotherapist. Physiotherapy is the branch of medical sciences which deals with the study of physical movement and working to prevent any kind of disabilities. The field of Physiotherapy is very challenging and vibrant, as the same exercise or massage is not applicable for all patients, all have to be treated differently. So, a Physiotherapist should do their therapy treatment with full calmness.\nEntrance exam: Respective institutes entrance exam"
      },
      {
        "name": "Bachelor of Veterinary Science - B.VSc",
        "duration": "5 years",
        "description": "B.VSc is an undergraduate course that provides academic as well as practical knowledge in assisting or working as the veterinary doctors in the laboratory. The course duration of B.VSc is 5 years.\nVeterinary is a branch of medical science that deals in the prevention, diagnosis and prevention of disease, disorder and injury in animals. The practitioner after completing the B.VSc course called a vet or an animal doctor.\nEntrance exam: NEET"
      },
      {
        "name": "Bachelor of Unani Medicine and Surgery - BUMS",
        "duration": "4.5 years",
        "description": "In the field of Unani Medicine and Surgery, BUMS is an undergraduate degree programme. BUMS degree is a 5.5 years duration course that comprises 4.5 years of academic session and one year of internship. This undergraduate programme can also be pursued through distance education. Central Council of Indian Medicine (CCIM) regulates the BUMS education and training in India.\nEntrance exam: NEET"
      },
      {
        "name": "Bachelor of Siddha Medicine and Surgery - BSMS",
        "duration": "5.5 years",
        "description": "Bachelor of Siddha Medicine and Surgery is an undergraduate program in Siddha System of Medicine. The duration of BSMS is 5.5 years which includes a one-year internship. BSMS is the most ancient among the AYUSH (Ayurveda, Yoga and Naturopathy, Unani, Siddha and Homeopathy) systems. Central Council of Indian Medicine (CCIM) governed the education of BSMS under the department of AYUSH.\nEntrance exam: NEET"
      },
      {
        "name": "Bachelor of Naturopathy and Yoga - BNYS",
        "duration": "4.5 years",
        "description": "Bachelor of Naturopathy and Yoga is a 4.5-year undergraduate degree program. Aspirants have to complete the one year Compulsory Rotatory Residential Internship for successful completion of the degree. Aspirants use to study the field of integrative medicine, which covers the study of both naturopathic medicine and modern science. Candidates qualifying 12th with science as compulsory subjects can apply for this course.\nEntrance exam: Respective institutes entrance exam"
      }
    ],
    "management": [
      {
        "name": "BBA",
        "duration": "3 years",
        "description": "BBA stands for Bachelor of Business Administration. BBA’s course duration is 3 years. There exists many Private as well as Government Institutes, which offers this course.\nIt is an Undergraduate course and even 12th Science/Commerce/Arts stream students may pursue it. After BBA, one may also go for PG (Post Graduate) course MBA. MBA will take another 2 years to complete! Some Colleges even provide BBA course that focuses on a particular discipline. For example- BBA in Airport Management and BBA in Event Management. If one pursues one such highly job oriented discipline, career prospects will sure get a boost!"
      },
      {
        "name": "BMS",
        "duration": "3 years",
        "description": "BMS stands for Bachelor of Management Studies. BMS’ course duration is 3 years. To the untrained eye, both BBA and BMS may look like the same course! To an extent, both BBA and BMS courses have lots of similarities too! They are basically Management related courses!\nBut upon taking a closer look, one can note differences between them. BMS is more focused on traditional management studies such as analytics. On the other hand, BBA is focused more towards core subjects related to Business studies. 12th passed students from any stream are eligible to pursue this course."
      },
      {
        "name": "BBA+MBA",
        "duration": "5 years",
        "description": "As the name suggests, this course is combination of both BBA as well as MBA Degrees. The course duration is 5 years. The biggest advantage of pursuing this course is that students won’t have to apply for PG course MBA after BBA separately. Further, only reputed Institutes are offering this Integrated course in India!\nMBA is a PG course. One must be a graduate to pursue MBA, in the traditional PG format. Integrated course like this one is beneficial for 12th passed students, who won’t have to prepare separately for MBA admission!"
      },
      {
        "name": "Degree in Hotel and Hospitality",
        "duration": "4 years",
        "description": "Hotel Management studies aims at preparing students to take on various roles in the tourism as well as Hotel Industries! Degree course- Bachelor of Hotel Management lasts 4 years.\nAfter graduation, one may find a good job in Tourism sector. Tourism sector is booming in India right now. Government is investing heavily in this sector and is coming up with innovative ideas such as Railway tourism, Adventure tourism, Ayurveda Tourism etc. All this means that the Hotel Management & Hospitality Business will continue creating new job opportunities!"
      },
      {
        "name": "BSc in Hotel Management",
        "duration": "3 years",
        "description": "This one is not your traditional management course. But at its heart, Hotel Management course can be said to be a branch of MBA itself!\nThis B Sc course is 3 years long. After completion of B Sc Degree, one may also go for M Sc or MBA. You may also check – BHM course.\nHotels and resorts are the prime recruiters. With experience, one may climb the career ladder slowly and steadily! One may also start up one’s own venture too, like establishing school/college canteens, opening catering service, establishing corporate canteens, setting up own hotel e"
      },
      {
        "name": "Diploma in Management",
        "duration": "1-2 years",
        "description": "The good news is that students from all streams- Science/Commerce/Arts are eligible to pursue these Diploma courses. I’ve listed some popular Diploma management courses below. Note that some Diploma courses are related to the Degree courses mentioned above. The duration of such a Diploma program is around 1-2 years.\nDiploma in Retail Management\nDiploma in Organization Management\nDiploma in Hotel Management\nDiploma in Hospitality and Tourism Management\nDiploma in Fashion Marketing and Merchandising\nDiploma in Marketing and Advertising\nDiploma in Event Management\nDiploma in Travel and Tourism Management"
      }
    ],
    "engineering": [
      {
        "name": "Computer Engineering",
        "duration": "4 years",
        "description": "This is a course students can take to learn about computers, their applicability, and resourcefulness in all domains. These engineers write computer programs as well as develop networks and design hardware, and other computer equipment such as processors, chips and circuits. IIT Kanpur, NIT Warangal, IIIT Hyderabad, BITS Pilani, DTU are the best colleges in India to pursue this course from.Experience a day in the life of a Computer Engineer through our virtual internship program in Computer Engineering."
      },
      {
        "name": "Electrical Engineering",
        "duration": "4 years",
        "description": "This field includes the study of electricity, electronics, electromagnetism, etc. Electrical engineers build devices for communication purposes and power distribution. The best colleges in India to pursue this course from are, IIT Chennai, BITS Pilani, and NIT Thiruchirappalli."
      },
      {
        "name": "Mechanical Engineering",
        "duration": "4 years",
        "description": "It deals with designing, manufacturing, and maintenance of mechanical systems. It includes principles from Physics and Material Science. Graduates often find lucrative career options. The best colleges in India that offer this course are IIT Kanpur, BITS Pilani, and Delhi Technological University.If you want to step into the shoes of a mechanical engineer before you make a choice, explore our virtual internship in Mechanical Engineering."
      },
      {
        "name": "Chemical Engineering",
        "duration": "4 years",
        "description": "It is the bridge between fundamental science subjects such as Chemistry, Biology, Mathematics and Physics, and engineering disciplines such as Computer Science, Mechanical, Civil and Electrical engineering. Their services are required in fields like Medicine, Biotechnology, manufacturing, and energy. The best colleges in India that offer this course are IIT Kanpur, IIT Mumbai, BITS Pilani, and Delhi Technological University."
      },
      {
        "name": "Civil Engineering",
        "duration": "4 years",
        "description": "It is the field in engineering that teaches students the science of construction. Engineers study design, construction, and maintenance of structures such as buildings, roads, canals, and dams. It is a little tougher to get established in this field compared to the other fields in engineering. IIT Kanpur, ISM Dhanbad, Anna University Chennai, and SVNIT Surat are the best places to purse this course."
      },
      {
        "name": "Marine Engineering",
        "duration": "4 years",
        "description": "This is the discipline that teaches students designing, developing, and testing vehicles and structures that are water-borne. Ships, boats, military vessels, submarines, oil rigs would all fall in this category. This is a type of engineering, but this course specifically looks at factors that condition the environment on the surface and underwater. Best colleges in India that offer this course are IIT Madras, IIT Kharagpur, and Andhra University College of Engineering."
      },
      {
        "name": "Automotive Engineering",
        "duration": "4 years",
        "description": "Such engineers design, develop, test and are involved in the manufacturing of all kinds of land-based vehicles. They design cars, motorcycles, utility vehicles, and buses to even military tanks. Top colleges that offer this course are IIT Madras, Delhi Technological University, Anna University in Chennai, and PSG College of Technology in Coimbatore."
      },
      {
        "name": "Aerospace Engineering",
        "duration": "4 years",
        "description": "This is the field of engineering that designs and develops aircraft, spacecraft, and navigation and communication tools for space exploration. Studying this course would help find jobs in the defense sector, space research organisations, aviation departments, and aeronautical laboratories. Best colleges in India that offer this course are IIT Kanpur, IIT Bombay, SRM University, and IIST in Trivandrum."
      },
      {
        "name": "Biotechnology",
        "duration": "4 years",
        "description": "This field combines principles from Biosciences and Engineering to develop and manufacture products. This course focuses on altering living organisms for human purposes and uses. Best colleges that offer this course in India are IIT Kharagpur, IIT Roorkee, BIT Mesra, and DTI."
      },
      {
        "name": "Nuclear Engineering",
        "duration": "4 years",
        "description": "This field of engineering deals with designing, constructing, operating and maintaining nuclear reactors, power plants, and weapons. This is done by studying nuclear fission and fusion and other various principles that govern the field of nuclear physics. The top colleges in India that offer this course are IIT Bombay, IIT Delhi, Indian School of Mines in Dhanbad and IIST in Trivandrum."
      }
    ]
  }