{
    "ngo": [
      {
        "name": "NGO Career in India",
        "description": "The term NGO stands for Non Governmental Organizations. NGO is defined as a non-profit making, voluntary, service-oriented organization, working for the benefit of the society in general and a target group in particular.\n\nNGO performs a variety of roles in our society and there is hardly any area which is left untouched by NGOs, be it natural resources, finance, human settlements, social development, culture, education, or even energy. NGOs have played an effective role in changing the landscape of the current-day world. They have become the conscience keepers of the modern democracy. Earlier people had a vague idea about what working in an NGO entails but now a sea change has been witnessed in the public’s perception of NGO and NGO workers."
      },
      {
        "name": "Who Should Work in an NGO?",
        "description": "Working in an NGO is not as comfortable a job as most people think. Nor is it a reflection of the all-out, shouting-for-the-underprivileged, taking-up-arms, stereotype we normally see in movies."
      },
      {
        "name": "Qualifications for NGO Jobs",
        "description": "Contrary to the popular beliefs, now a days NGOs have become more specialized and business oriented. Owing to the nature of their work and their target group they aim for recruiting specialists for their jobs viz. a Non Government Organization working in the field of women’s issue would prefer a specialist (say Gynecologist to provide better medical care) on the issue.\n\nLikewise some NGO working on issues relating to international issues would prefer post:graduates in international relations, one dealing with issues of industrial workers prefer post graduates in industrial worker’s laws or trade disputes. In this way a person has to be careful in choosing NGO which is related to his/her (job aspirant) qualification.\n\n post graduation degree in Social Work is desired for but even otherwise a degree in post graduation in the subject close to the target area of the NGO assures a beginning. An NGO like WWF (World Wide Fund for Nature) is most likely to prefer students who post graduate in environmental sciences. These days even"
      },
      {
        "name": "NGO Job Prospects",
        "description": "Today NGOs have a highly corporatised structure where there are different levels of hierarchy. Usually the person starts as a Research Fellow depending upon his/her professional qualifications. Climbing up the hierarchy he/she can become group:leader and later team leader. Many professionals join NGOs at a later stage of their life in their capacity as goodwill ambassadors or advisors. There is definitely no maximum age limit but certain minimum qualifications are required."
      },
      {
        "name": "NGO Pay Package",
        "description": "On an average a social worker engaged with an NGO draws about Rs 5000 at the starting of his/her career. However, in most of the cases, one’s salary depends on the size of the organization. In a smaller organization one may have to start at a salary of Rs 3000 to Rs 6000 per month. While those hired as personnel and labour welfare officers can draw a starting pay of Rs 7000 or more."
      }
    ],
    "finance": [
      {
        "name": "Investment Banking",
        "description": "An investment banker works for a financial institution that provides a clutch of complex financial services and transactions sought by institutional or corporate clients such as companies, pension funds, governments and hedge funds.\nMany large banks have an investment banking division, which is another employment avenue for the lowly analyst hoping to become a high-profile investment banker one day.\nInvestment banking offers the most lucrative salaries in the finance sector. Junior staff in front-office investment banking, such as sales, trading, research and M&A, draw as much as $195,000 a year, while associates can reel in a cool $270,000."
      },
      {
        "name": "Asset Management",
        "description": "Asset management services are provided by large corporate entities, investment banks and independent financial advisers. Large banks and brokerage houses also have separate divisions dedicated to selling both proprietary and non-proprietary products and services to high net-worth clients. And then there are private or independent portfolio managers who along with their teams work, one-on-one, with the uber-rich.\nOK, so here’s your moment of truth: how wealthy can a wealth manager be? On the lowest rung of the ladder, say, as a Financial Planner or a Relationship Manager, you can hope to earn Rs 3.3 lakh a year, which could go up to Rs 11 lakh for a Senior Business Analyst and as high as Rs 23 lakh for a wealth manager or private banker."
      },
      {
        "name": "Financial Analyst",
        "description": "An analyst also recommends action, such as buying or selling stocks; looks into a company’s financial health; helps in arriving at a valuation of a company for mergers & acquisitions; and devises financial models to predict economic conditions.\nAn analyst plays a critical role in any business that his or her firm is representing. They take into account their client’s financial history, the vision of the company and direction it wants to take. They examine their client’s income and expenditure, risk tolerance and assess its current investments."
      },
      {
        "name": "Financial Trading",
        "description": "Much has been said about a trader’s risk-taking appetite but, perhaps, not enough about how important it is to use restraint while taking split-second decisions on the trading floor.\nAfter all, in this career track, we are talking about how millions can be made – or lost – in the blink of an eye.\nYes, traders are a special breed. But before we get to that, let’s see what this sub-group of finance specialists actually does.\nVery simply, financial traders buy and sell securities – stocks, bonds, commodities, currencies or other financial instruments – on behalf of their clients.\nHe or she is literally a middleman between the investing public and entities such as companies and even governments who are selling a variety of financial instruments.\nSo how does a trader differ from a broker, you know, the guy you call when you have a hot tip on a stock or when you’re in the mood to play the markets?\nIt’s simple. While a broker executes trades on behalf of their clients (yes, the guy you call when you have a hot tip), a trader does not directly interact with the investing public."
      },
      {
        "name": "Bank Manager",
        "description": "When it comes to actual banking functions, some of your key duties would be making sure your branch meets (and preferably exceeds!) its sales and performance targets; developing a business plan for your branch; implementing business, marketing and sales plans; assessing lending risk; marketing your bank’s financial products; and producing reports.\nYou would also oversee the flow of cash and financial instruments, make sure security and cash-handling procedures are followed; and even see that the ATM is never out of cash!"
      },
      {
        "name": "Insurance Manager",
        "description": "Typically, insurance managers oversee all types of specialists such as brokers, underwriters, risk managers, claims investigators, actuaries and appraisers at the branch but they are especially concerned with the skills and performance of their sales agents.\nOne, their team’s collective performance will determine whether or not the branch meets it targets; and, two, the insurance manager’s remuneration includes ‘overrides’, which is a sum based on their agents’ commissions."
      }
    ],
    "marketing": [
      {
        "name": "Media Managers",
        "description": "This marketing role is concerned with designing multi-channel campaigns to raise awareness about and driving the adoption of a brand, product, or service. Digital media managers are also responsible for deciding the brand’s digital strategy and messaging.\nIf we look at the specifics, digital media management primarily aims at the twin goals of customer acquisition and lead generation. This field requires people with an analytical mind who can benchmark performance and forecast results in keeping with the nuances of consumer behavior."
      },
      {
        "name": "Pay-Per-Click Managers",
        "description": "These marketing professionals enhance PPC campaigns using budgeting, keyword selection, copy improvement, comprehensive search strategies, etc. PPC managers are expected to handle various ad types, such as Google Display, Bing ads, and other paid search engine advertising.\nAll in all, they implement strategies for their clients and support initiatives that contribute to achieving the intended goals. The demand for PPC managers and the salary making it one of the highest paying digital marketing jobs in India.\nAnnual salary: Rs 10,48,883"
      },
      {
        "name": "SEM/SEO Specialists",
        "description": "Search Engine Marketing (SEM) involves techniques like search engine optimization or SEO, pay-per-click, and paid advertising. As an SEM specialist, you would be tasked with ensuring that when your target prospects look for a particular thing online, they see your organization in the top results. The excessive & growing demand makes SEM/SEO specialists, land on one of the highest salary digital marketing jobs in India\nYou would also manage online campaigns and update the websites to drive search results (for example, blogs and RSS feeds) to establish a viable business case for SEM expenditure. It has always been one of the best digital marketing jobs in India, and dealing with money – yours and others – is the stuff of dreams.\nAnnual salary: Rs 360,098 (entry-level) and Rs 975,000 (mid-senior level)"
      },
      {
        "name": "Content Strategists",
        "description": "As one of the highest paying digital marketing jobs, In an increasingly digital world, the issues of unnecessary clutter and short attention spans also hamstring the marketing efforts. Today’s consumers spend a lot of time online, but they are too busy and spoilt for options. So, a well-thought-out content strategy can prove to be a valuable asset. Hence, it is not surprising that such roles are among the highest paying jobs in digital marketing.\nAnnual salary: Rs 6,92,498"
      },
      {
        "name": " E-commerce Specialist",
        "description": "One of the highest paying digital marketing jobs worldwide, E-commerce has emerged as a cost-effective solution for retailers over the last few years. Since there is no requirement for physical space, a significant portion of the overheads can be saved.\nE-commerce specialists are adept at optimizing product pages with proper descriptions and button placements. With this, they improve the customer experience and increase conversions. They also collaborate with cross-functional teams (sales and marketing) to set lead generation and sales targets. \nAnnual salary: Rs 3,00,000 (starting); Rs 10,86,571 (mid-career)"
      },
      {
        "name": "Brand Marketing Expert",
        "description": "With the growing online presence of both consumers and businesses, it is becoming increasingly important to invest time and money in digital brand building. Companies can no longer escape unsatisfactory product reviews and poor customer service. Moreover, digital media provide tremendous opportunities for storytelling and engagement. An organization’s narrative (on its website and social media platforms) speaks to its targets about its values.\nAnnual salary: ₹10,77,700"
      },
      {
        "name": "Social Media Marketers",
        "description": "Social media marketing is all about designing strategies to promote brands and implementing campaigns to boost audience engagement on social networking platforms. Nowadays, businesses prefer to hire individuals who specialize in managing such online efforts. If the brand does well on social media, it can pace up the website traffic. Email marketers are another type of content marketers who assist in similar activities of promotion and lead generation. In addition to being one of the highest paying digital marketing jobs in India, it is also a fast-paced one.\nAnnual salary: Rs 3,42,814"
      },
      {
        "name": "Marketing Analysts",
        "description": "Marketing analysts use analytics tools and report various market metrics to facilitate the success of organic and paid campaigns. Market research and analysis lies at the heart of their work in any organization. It has always been one of the best digital marketing jobs in India, and dealing with money – yours and others – is the stuff of dreams. Strong quantitative skills, statistical prowess, and data visualization experience are a must for them."
      }
    ],
    "accounting": [
      {
        "name": "Accounting Manager",
        "description": "Accounting managers oversee the operations of an organization’s accounting department. They analyze and report financial information, assist with tax processing, and create financial statements to present to the company’s board of directors.\nAverage Salary: $77,395"
      },
      {
        "name": "Budget Analyst",
        "description": "Budget analysts help companies organize their finances, prepare budget reports, and monitor institutional spending. They regularly review an organization’s financial plans for completeness, accuracy, and conformance with regulations and organizational objectives.\nAverage Salary: $76,540"
      },
      {
        "name": "Senior Tax Accountant",
        "description": "Tax accountants prepare federal, state, and local tax returns for individuals, businesses, or other organizations.\nAverage Salary: $74,258"
      },
      {
        "name": "Accountant",
        "description": "Accountants prepare, maintain, and examine the accuracy of financial statements for an organization. They ensure all financial records, such as balance sheets, income and loss statements, cash flow statements, and tax returns, are compliant with federal laws, regulations, and generally accepted accounting principles (GAAP). They are also responsible for identifying and resolving any discrepancies in records, statements, or documented transactions.\nAverage Salary: $71,550"
      }
    ],
    "healthcare": [
      {
        "name": "Medical Biller and Coder",
        "description": "Medical billers and coders support healthcare providers, helping them collect payments for their services in a timely manner. Medical coders assign each diagnosis and procedure a universal identifier, using standard industry codes. Once patient records have been properly coded, medical billers send the invoice, or claim, to the insurance company or other payer for reimbursement."
      },
      {
        "name": "Dental Assistant",
        "description": "Dental assistants do a variety of tasks to help dental practices run smoothly. They may work with patients, help keep office records, and schedule appointments.\nA dental assistant is most often a full-time position and takes place in a dentist’s office. Dental assistants may also sometimes work in schools, hospitals, or nursing homes."
      },
      {
        "name": "Phlebotomy",
        "description": "Phlebotomists are responsible for drawing blood from patients. This could be for routine tests, medical research, blood transfusions, or blood donations.\nHospitals are the most common place for phlebotomists to work. Other common workplaces include laboratories, doctor’s offices, and blood donor facilities. Phlebotomists often work full-time."
      },
      {
        "name": "Pharmacy Technicians",
        "description": "Pharmacy technicians are instrumental to pharmacies. They help patients or medical professionals fill prescriptions and get the medicine they need.\nPharmacy technicians work in pharmacies, usually with full-time hours. They could be located in pharmacies and drug stores, retail establishments like grocery stores, or hospitals."
      },
      {
        "name": "Nursing Assistant",
        "description": "Nursing assistants help to care for patients. They assist with tasks like checking patients’ vital signs and helping patients stay clean. Different workplaces may offer different responsibilities, like giving patients their medicine and helping them to eat.\nSome nursing assistants work in hospitals. Others work in nursing homes or other residential facilities. This is most often a full-time job and may require working nights, weekends, and holidays."
      },
      {
        "name": "Medical and Clinical Laboratory Technicians",
        "description": "Medical and clinical laboratory technicians work to collect various medical samples. Depending on their specific job title, medical laboratory technicians may analyze samples from different parts of the body, like tissue, bodily fluids and more.\nThis is typically a full-time job, according to the BLS. Medical and clinical laboratory technicians often work in hospitals, laboratories, and doctor’s offices. The median annual salary for this position was $51,770, or $24.89 per hour, as of May 2017. This means that about half of the workers in this occupation earned more, and half earned less."
      },
      {
        "name": "Medical and Health Services Managers",
        "description": "Medical and health services managers can run entire medical facilities or specific departments within medical facilities. These roles come with a lot of responsibilities, since healthcare regulations and legislation are frequently changing, and medical facilities have to constantly adapt to stay compliant.\nHospitals are the largest employer of medical and health services managers, according to the BLS. Group medical facilities and nursing homes also employ medical and health services managers."
      }
    ],
    "technology": [
      {
        "name": "Applications Programmer",
        "description": "Simply put, applications programmers write the code for the software used in computers and other electronic devices.\nThey create software applications by writing code that is error-free, maintainable, and scalable. They also test and evaluate applications, and tweak and improve applications to make them user-friendly.\nOther tasks may include interacting with customers to find out their requirements, preparing software and training manuals, and training users.\nAs an applications programmer, your first task would often be to find out your project requirements at meetings with the manager, the analyst, and most importantly, the client.\nThis would enable you to confirm the input and output information that you need in order to create the software code for your project.\nAccording to websites giving salary data, the annual earnings of an applications programme can be anywhere between Rs. 1.23 lakh and Rs. 11 lakh in India ($42,000 – $96,000 in the US)."
      },
      {
        "name": "Project Manager (IT)",
        "description": "Your responsibilities would involve conceiving a project to cater to all of the client’s requirements, executing it, monitoring the implementation, and handing over the installation to the client.\nFor the IT project manager, every project would start by meeting the client to understand the client’s requirements.\nYou would then start planning the project stages and putting together a team to implement the project.\nIT companies followed by banks are among the top employers of IT project managers. According to Internet sources, the annual salary of an IT project manager is between Rs. 7 lakh and Rs. 20 lakh in India ($50,000 and $130,000 in the US)."
      },
      {
        "name": "Database Administrator",
        "description": "The typical DBA usually has a long list of responsibilities: install, upgrade, administer, monitor, maintain, and secure databases of organisations.\nThe main objective of DBAs is to use their knowledge and skills to make information available readily to database users, monitor and secure databases, design and adopt development strategies for database management, and conceive plans for handling future requirements.\nAnnual salaries in India range from Rs. 1,82,000 to Rs. 9,48,000 ($40,000 – $103,000 in the US).As no organisation can afford a database outage, DBAs are on their toes almost all the time."
      },
      {
        "name": "IT business analyst",
        "description": "IT business analyst (IT BA) builds a winning partnership between business and technology. A competent IT BA puts together a bridge that effectively integrates the business requirements of a client with the best technology solutions.\nYou will also keep an eye on the progress of the project (though project schedule monitoring is the job of the project manager), and get the developers to carry out any mid-course corrections in case the client makes any minor changes in the project requirements."
      },
      {
        "name": "Software Quality Assurance (Testing)",
        "description": "The software QA professional is in charge of the quality of software right from the day plans are on the drawing board to the day of product release.\nDuring the process of developing software, the test engineer conducts several checks to confirm whether it is working smoothly. He or she anticipates problems and tests the software by creating situations in which it can go wrong."
      },
      {
        "name": "Information Security Officer",
        "description": "Information security specialists protect the computer networks, systems, and devices of organisations by identifying security loopholes and taking steps to plug these gaps.\nThey safeguard information from being accessed by unauthorised persons and create firewalls or encryptions to prevent breach of databases and other information systems.\nThey are constantly on the watch for any illegal access or abnormal activity that indicates that the system or network is facing danger from intruders."
      },
      {
        "name": "Software Trainer",
        "description": "Software trainers usually have an excellent understanding of a wide range of software programs and applications that are generic, company-specific, or job-specific.\nGreat trainers are captivating speakers with a flair for explaining technical concepts lucidly and keeping their audience of end-users of software or software customers engaged.\nThe success of a software application may depend on whether the trainer is able to convince his or her audience about the advantages of using the software."
      }
    ],
    "humanResource": [
      {
        "name": "HR Manager",
        "description": "Human Resource Managers are generalists who act as links between the directors and the executive level of corporate management. They spearhead teams of recruiters and other specialists to tackle particular HR-related problems and deliver successful projects. They also ensure that all procedures are in line with business laws and company policies.\nIn India, HR managers can earn an average salary of Rs 7,09,361 per annum, depending upon the company and the city."
      },
      {
        "name": "Training and Development Manager",
        "description": "These HR professionals work involves supporting the employees through education, training, and career planning interventions. These activities range from organizing orientation sessions for new employees to facilitating in-person workshops for existing staff to conducting personal and professional development courses.\nAccording to PayScale, mid-career training and development managers in India are paid total compensation of Rs 7,76,418 per year."
      },
      {
        "name": "Compensation and Benefits Manager",
        "description": "This HR managerial position involves the preparation of compensation and benefits programs for organizations. Their work includes selecting and implementing plans by synchronizing their company’s budgetary constraints with the employees’ demands. The end goal is to pick the remuneration policy that allows for attracting and retaining talent.\nIn India, the average annual salary of compensation and benefits managers is estimated at Rs 12,99,064."
      },
      {
        "name": "Recruitment and Placement Manager",
        "description": "The person at the helm of hiring new employees in a corporate is generally given the Employment, Recruitment, and Placement Manager title. The primary job duties include directing the team.\nThese managers typically work under the guidance of HR managers or directors. Moreover, they have to communicate with the hiring managers of different departments to get an idea about their personnel needs and vacancies."
      },
      {
        "name": "HR Consultant",
        "description": "HR consultants are skilled in analyzing a company’s human resources situation and devising policies, employment structure, benefits packages, performance incentives, and many other issues. These experts usually work in a contractual capacity, helping HR managers with specific tasks.\nIn India, you can make Rs 4,00,852 per annum on average with a private HR consulting practice."
      },
      {
        "name": "Executive Recruiter",
        "description": "Executive recruiters or headhunters are responsible for finding senior executives to fill leadership roles in corporations and large nonprofits. They need to have some idea about the hiring industry to convince prospects to join their client organization. It is a high-responsibility job as it requires you to develop a plan for why a senior professional should leave their current place of work and work for the competitor.\nstarting annual earnings of an executive recruiter in India at Rs 4,50,000."
      },
      {
        "name": "International HR Associate",
        "description": " HR position comes with global responsibility. International HR associates perform generalist tasks, such as posting jobs, screening applicants, reviewing compensation and benefits packages, and so on. For a multinational corporation, these standard activities have to be adjusted according to the employment markets around the world. Therefore, their role encompasses fine-tuning HR strategies accordingly.\nThe median annual salary is approximated at Rs 4,65,434."
      },
      {
        "name": "Employee Relations Specialist",
        "description": "These specialists act as a bridge between management and labor unions in large corporations. They draw up employment contracts adhering to labor regulations and demands. They also represent their client company in any legal action and sometimes serve as public relations specialists.\nPayScale reports the average total compensation for employee relations professionals in India to be Rs 4,54,505 a year."
      }
    ]
  }